---
kind: type
id: T:Autodesk.Revit.DB.Visual.AdvancedMetal
source: html/762ef4cc-3219-0f8a-8cd5-137e20225eb0.htm
---
# Autodesk.Revit.DB.Visual.AdvancedMetal

A static class that provides access to the property names that appear in the AdvancedMetal visual asset schema.

## Syntax (C#)
```csharp
public static class AdvancedMetal
```